package codingTest.day8;

public class Day8Q4 {
    public int solution(String number) {
        int answer = 0;
        for(int i=0; i<number.length(); i++){
            answer += number.charAt(i) -'0';
        }

        return answer%9;
    }

    /*
    `number.charAt(i) - '0'`를 사용하는 이유는 문자를 해당하는 숫자로 변환하기 위함입니다.
    Java에서 문자는 내부적으로 ASCII 값으로 표현됩니다. '0'부터 '9'까지의 문자는 연속적으로 ASCII 값이 할당되어 있습니다.
    예를 들어, '0'의 ASCII 값은 48이고, '1'은 49, '2'는 50, ..., '9'는 57입니다.
    따라서 `'0'`을 문자열에서 빼면 해당하는 숫자의 ASCII 값에서 '0'의 ASCII 값인 48을 빼주면 원하는 숫자를 얻을 수 있습니다.
    이렇게 하면 문자 '0'부터 '9'까지의 각각에 해당하는 정수값(0부터 9까지)을 얻을 수 있습니다.
    예를 들어, 문자열 "123"에서 각 문자를 정수로 변환할 때:
    - '1'을 정수로 변환하려면 `'1' - '0'`으로 계산하면 됩니다. 결과는 1이 됩니다.
    - '2'를 정수로 변환하려면 `'2' - '0'`으로 계산하면 됩니다. 결과는 2가 됩니다.
    - '3'을 정수로 변환하려면 `'3' - '0'`으로 계산하면 됩니다. 결과는 3이 됩니다.
    따라서 위의 코드에서는 각 문자를 정수로 변환한 후에 모두 더하여 반환하기 위해 `'0'`을 빼주는 것입니다.
    이러한 방식을 사용하면 문자열에서 각 자릿수를 숫자로 쉽게 변환할 수 있습니다.
    */
}
